dotfiles/TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-15 Thu 01:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dotfiles TODO list.</title>
<meta name="author" content="Taylor Shin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Dotfiles TODO list.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga6bbc36">1. <span class="todo TODO">TODO</span> Let&rsquo;s re-write bash initialization script to be more compliant to the POSIX standard since <code>/bin/sh</code> are not usually actual bash in some distributions.</a>
<ul>
<li><a href="#org3e6564e">1.1. As the Luke guy said, many linux distributions employ faster variant of bash shells for initializing system and user&rsquo;s space. And my start-up script is already getting bloated a lot! So, why not!</a></li>
<li><a href="#org6468065">1.2. Bash surely provide a lot of handy features. But sometimes, old versions of bash does not provide grammars that are almost became standard to newer versions. Some distributions even use pre 4.X version of bash!</a></li>
<li><a href="#orgd6c27ba">1.3. This is not impossible job since most of my init scripts are super simple in terms of functionality.</a></li>
</ul>
</li>
<li><a href="#org7dcc3aa">2. <span class="todo TODO">TODO</span> RClone job (mainly, mounting those cloud storage drives) seems to be done when booting up the system not when running terminal emulator.</a>
<ul>
<li><a href="#orgfd6d687">2.1. Let&rsquo;s implement RClone mounting when rebooting the computer or system initializing stage. Not when running the terminal emulator for the first time after reboot.</a></li>
<li><a href="#org94ce705">2.2. But keep the RClone set up part in tact in the separate script. Throwing in those set-up scripts when booting up isn&rsquo;t really comfortable to handle.</a></li>
</ul>
</li>
<li><a href="#org3907f4e">3. <span class="todo TODO">TODO</span> Find out more elegant way to handle gitconfig.local. This file contains my own Github token which must not be uploaded to any non-secure locations. But copying and pasting this file every time from my personal e-mail account is not really efficient.</a>
<ul>
<li><a href="#org4056aab">3.1. Privacy vs. convenience. That is the question.</a></li>
<li><a href="#org7d615e6">3.2. Certainly, there are ways to access private storage. But that also requries revealing my credentials anyway.</a></li>
<li><a href="#orgccef448">3.3. Gotta think about using those cryptography tools.</a></li>
</ul>
</li>
<li><a href="#orga1bcc15">4. <span class="todo TODO">TODO</span> Write a curl based installation script for this entire repository. Checking out every time makes me feel boring!</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga6bbc36" class="outline-2">
<h2 id="orga6bbc36"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Let&rsquo;s re-write bash initialization script to be more compliant to the POSIX standard since <code>/bin/sh</code> are not usually actual bash in some distributions.</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3e6564e" class="outline-3">
<h3 id="org3e6564e"><span class="section-number-3">1.1</span> As the Luke guy said, many linux distributions employ faster variant of bash shells for initializing system and user&rsquo;s space. And my start-up script is already getting bloated a lot! So, why not!</h3>
</div>
<div id="outline-container-org6468065" class="outline-3">
<h3 id="org6468065"><span class="section-number-3">1.2</span> Bash surely provide a lot of handy features. But sometimes, old versions of bash does not provide grammars that are almost became standard to newer versions. Some distributions even use pre 4.X version of bash!</h3>
</div>
<div id="outline-container-orgd6c27ba" class="outline-3">
<h3 id="orgd6c27ba"><span class="section-number-3">1.3</span> This is not impossible job since most of my init scripts are super simple in terms of functionality.</h3>
</div>
</div>
<div id="outline-container-org7dcc3aa" class="outline-2">
<h2 id="org7dcc3aa"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> RClone job (mainly, mounting those cloud storage drives) seems to be done when booting up the system not when running terminal emulator.</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfd6d687" class="outline-3">
<h3 id="orgfd6d687"><span class="section-number-3">2.1</span> Let&rsquo;s implement RClone mounting when rebooting the computer or system initializing stage. Not when running the terminal emulator for the first time after reboot.</h3>
</div>
<div id="outline-container-org94ce705" class="outline-3">
<h3 id="org94ce705"><span class="section-number-3">2.2</span> But keep the RClone set up part in tact in the separate script. Throwing in those set-up scripts when booting up isn&rsquo;t really comfortable to handle.</h3>
</div>
</div>
<div id="outline-container-org3907f4e" class="outline-2">
<h2 id="org3907f4e"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Find out more elegant way to handle gitconfig.local. This file contains my own Github token which must not be uploaded to any non-secure locations. But copying and pasting this file every time from my personal e-mail account is not really efficient.</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4056aab" class="outline-3">
<h3 id="org4056aab"><span class="section-number-3">3.1</span> Privacy vs. convenience. That is the question.</h3>
</div>
<div id="outline-container-org7d615e6" class="outline-3">
<h3 id="org7d615e6"><span class="section-number-3">3.2</span> Certainly, there are ways to access private storage. But that also requries revealing my credentials anyway.</h3>
</div>
<div id="outline-container-orgccef448" class="outline-3">
<h3 id="orgccef448"><span class="section-number-3">3.3</span> Gotta think about using those cryptography tools.</h3>
</div>
</div>
<div id="outline-container-orga1bcc15" class="outline-2">
<h2 id="orga1bcc15"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Write a curl based installation script for this entire repository. Checking out every time makes me feel boring!</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Taylor Shin</p>
<p class="date">Created: 2021-04-15 Thu 01:13</p>
</div>
</body>
</html>
